//位运算符，查图
#include <stdio.h>
int main()
{
    int a, b;
    a = 3;
    b = 5;
    printf("%d\n",a&b);     //二进制与的运算，可看计算机系统      与0做与运算：清除运算（全为0）
    a = 006;                //8进制表示？？？过程是转化为二进制判断后输出十进制
    b = 017;                //8进制表示？？？
    printf("%d\n",a|b);     //二进制或的运算    与1做1运算：全为1
    a = 071;
    b = 052;
    printf("%d\n",a^b);     //二进制非的运算
    a = 077;
    printf("%d\n",~a);      //取反运算符
    a=15;
    printf("%d\n",a<<2);    //左移运算符移走后用0填补，右移运算符同理


    //**a &= b;等价a = a & b;**


    system("pause");
    return 0;
}

